In [1]:
# import libraries
import pandas as pd

In [2]:
# load raw data
df = pd.read_csv(r"C:\Users\youtechbd\Downloads\raw_data (1).csv")

In [3]:
# check information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2564680 entries, 0 to 2564679
Data columns (total 8 columns):
 #   Column              Dtype
---  ------              -----
 0   id                  object
 1   gender              object
 2   dob                 object
 3   income              int64
 4   marital_status      object
 5   city                object
 6   last_purchase_date  object
 7   score               int64
dtypes: int64(2), object(6)
memory usage: 156.5+ MB

In [4]:
# check first 5 data
df.head()

,id,gender,dob,income,marital_status,city,last_purchase_date,score
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,08-04-2020,43
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,27-05-1992,83451,Divorced,Colorado Springs,18-12-2020,653
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,NaN,New Orleans,2021-05-25,535

In [5]:
# checking for missing values
df.isna().sum()

id                         0
gender                234849
dob                        0
income                     0
marital_status        285195
city                   51187
last_purchase_date         0
score                      0
dtype: int64

In [6]:
# checking for duplicated records
df.duplicated().sum()

2464680

In [7]:
# removing duplicate records
df = df.drop_duplicates()

In [8]:
df

,id,gender,dob,income,marital_status,city,last_purchase_date,score
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,08-04-2020,43
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,27-05-1992,83451,Divorced,Colorado Springs,18-12-2020,653
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,NaN,New Orleans,2021-05-25,535
...,...,...,...,...,...,...,...,...
861286,5716106a-8d4e-4e6f-9e84-d328747829b9,Female,1986-10-23,13986,Married,Las Vegas,07-11-2013,97
878293,cd28ebf2-7044-4a48-888f-3bf1b1d0c78e,Male,1976-10-12,69519,Divorced,Omaha,2011-08-03,1000
903223,59e2af4b-f282-4998-97f5-1bb70542633d,Female,05-04-1979,97057,Divorced,Tucson,04-01-2016,579
980974,4409db67-1df6-4080-b279-54740e79bceb,Male,1974-05-12,42351,NaN,Austin,2012-07-22,666
984525,ff4d610e-ced0-444c-bbb6-60086fea6f0f,Female,1994-10-23,69935,Single,Portland,2022-09-04,839

In [9]:
# checking for missing values
df.isna().sum()

id                        0
gender                 9150
dob                       0
income                    0
marital_status        11131
city                   2002
last_purchase_date        0
score                     0
dtype: int64

In [10]:
# filling missing values with the mode of the respective columns

In [11]:
from scipy import stats

In [12]:
stats.mode(df.gender)

ModeResult(mode=array(['Male'], dtype=object), count=array([45587]))

In [13]:
df.gender=df.gender.fillna('Male')

In [14]:
df.gender.isna().sum()

0

In [15]:
stats.mode(df.marital_status)

ModeResult(mode=array(['Divorced'], dtype=object), count=array([22231]))

In [16]:
df.marital_status = df.marital_status.fillna('Divorced')

In [17]:
df.marital_status.isna().sum()

0

In [18]:
stats.mode(df.city)

ModeResult(mode=array(['Baltimore'], dtype=object), count=array([2098]))

In [19]:
df.city = df.city.fillna('Baltimore')

In [20]:
df.city.isna().sum()

0

In [21]:
df.isna().sum()

id                    0
gender                0
dob                   0
income                0
marital_status        0
city                  0
last_purchase_date    0
score                 0
dtype: int64

In [22]:
# converting dob column to datetime format
df['dob'] = pd.to_datetime(df['dob'])

In [23]:
df.head()

,id,gender,dob,income,marital_status,city,last_purchase_date,score
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,08-04-2020,43
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,1992-05-27,83451,Divorced,Colorado Springs,18-12-2020,653
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,Divorced,New Orleans,2021-05-25,535

In [24]:
# calculating age based on dob
df['age'] = (pd.Timestamp.now() - df['dob']).astype('<m8[Y]')

In [25]:
df.head()

,id,gender,dob,income,marital_status,city,last_purchase_date,score,age
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63,45.0
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,08-04-2020,43,22.0
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882,47.0
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,1992-05-27,83451,Divorced,Colorado Springs,18-12-2020,653,30.0
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,Divorced,New Orleans,2021-05-25,535,35.0

In [26]:
# categorizing customers into income groups based on percentiles

In [27]:
# calculate the percentiles
p33, p66 = df['income'].quantile([0.33, 0.66])

# define the function to categorize income
def income_group(x):
    if x <= p33:
        return 'Low'
    elif x <= p66:
        return 'Medium'
    else:
        return 'High'

# apply the function to create the income_group column
df['income_group'] = df['income'].apply(income_group)

# print the first 5 rows of the updated dataset
df.head()

,id,gender,dob,income,marital_status,city,last_purchase_date,score,age,income_group
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63,45.0,Medium
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,08-04-2020,43,22.0,Low
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882,47.0,Medium
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,1992-05-27,83451,Divorced,Colorado Springs,18-12-2020,653,30.0,High
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,Divorced,New Orleans,2021-05-25,535,35.0,Medium

In [28]:
# categorizing customers into score groups based on percentiles

In [29]:
# calculate the percentiles
p33, p66 = df['score'].quantile([0.33, 0.66])

# define the function to categorize score
def score_group(x):
    if x <= p33:
        return 'Poor'
    elif x <= p66:
        return 'Fair'
    else:
        return 'Good'

# apply the function to create the score_group column
df['score_group'] = df['score'].apply(score_group)

# print the first 5 rows of the updated dataset
df.head()

,id,gender,dob,income,marital_status,city,last_purchase_date,score,age,income_group,score_group
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63,45.0,Medium,Poor
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,08-04-2020,43,22.0,Low,Poor
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882,47.0,Medium,Good
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,1992-05-27,83451,Divorced,Colorado Springs,18-12-2020,653,30.0,High,Fair
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,Divorced,New Orleans,2021-05-25,535,35.0,Medium,Fair

In [30]:
df.shape

(100000, 11)

In [31]:
df.isna().sum()

id                    0
gender                0
dob                   0
income                0
marital_status        0
city                  0
last_purchase_date    0
score                 0
age                   0
income_group          0
score_group           0
dtype: int64

In [32]:
df.income_group.value_counts()

High      33999
Medium    33001
Low       33000
Name: income_group, dtype: int64

In [33]:
df.score_group.unique()

array(['Poor', 'Good', 'Fair'], dtype=object)

In [34]:
df.score_group.value_counts()

Good    33999
Poor    33095
Fair    32906
Name: score_group, dtype: int64

In [35]:
# removing rows where last_purchase_date is before 2019

In [36]:
# convert last_purchase_date to datetime format
df['last_purchase_date'] = pd.to_datetime(df['last_purchase_date'])

# filter out rows where last_purchase_date is before 2019
df = df[df['last_purchase_date'].dt.year >= 2019]

In [37]:
df.head()

,id,gender,dob,income,marital_status,city,last_purchase_date,score,age,income_group,score_group
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63,45.0,Medium,Poor
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,2020-08-04,43,22.0,Low,Poor
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882,47.0,Medium,Good
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,1992-05-27,83451,Divorced,Colorado Springs,2020-12-18,653,30.0,High,Fair
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,Divorced,New Orleans,2021-05-25,535,35.0,Medium,Fair

In [38]:
df.shape

(30947, 11)

In [39]:
# saving the cleaned data to a new CSV file
df.to_csv('clean_data.csv', index = False)